[M_Sage_PallingAround MissionDefinition]
MissionName="to become friends"
MissionDescription="Lord Hammerlock discovers the Dorosimian's weapon. [place]Fishing cave[-place]. He assumes you want to hunt him because of your scavenger reputation.."
TurnInDescription="Hammerlock, you want to go hunting again with your friends.."
MissionSummary="Break the armor with Thor."
MissionGiver="The master of the hammer"
MissionTurnInLocation="hammer lock"
TeaserText="The story of a great bull and a great gun parent in search of a disciple.."

[M_Sage_PallingAround:FindCreature MissionObjectiveDefinition]
ProgressMessage="I am looking for a pitbull"

[M_Sage_PallingAround:FindCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_PallingAround:KillCreature MissionObjectiveDefinition]
ProgressMessage="kill ship"

[M_Sage_PallingAround:KillCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Lord Hammerlock finds the armored Thorosian in hiding. [place]Hunter's cave[-place]. He thought you would eat it because your name gave away your animal punishment..<br>It is recommended that you keep your distance before seeing Torosimini, as he turns into a ball when you approach him.."

